if OS.mac?
  brew "reattach-to-user-namespace"

  brew "cmake"
  brew "cscope"
  brew "git"
  brew "keychain"
  brew "openssh"
  brew "universal-ctags"
  brew "wget"

  # QLColorCode
  brew "highlight" if MacOS.version < :catalina
end

brew "bat"
brew "bottom"
brew "fd"
brew "lazygit"
brew "mise"
brew "pre-commit"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "vim"
brew "z"
